//简体中文
export default {
    //main.ts
    '110001': '用当前文档名搜索豆瓣并写入当前文档',
    '110002': '在豆瓣搜索并写入到当前文档',
    '110003': `输入搜索内容:`,
    '110004': `搜索`,
    '110005': `取消`,
    '110006': `同步豆瓣广播至Obsidian`,

    //DoubanSettingTab
	'1201'	: `Obsidian-豆瓣`,
    '120001': `豆瓣搜索地址`,
    '120002': `豆瓣搜索页面请求地址, 通常是网页搜索的地址. `,
    '120003': `先访问:`,
    '120004': `然后在搜索输入框不输入任何内容,直接点击搜索,`,
    '120005': `所跳转的网页地址即是搜索地址,`,
    '120006': `将网页地址复制到当前输入框即可,`,

    '120101': `电影文本模板`,
    '120102': `设置选择电影后导入的文本内容模板,`,
    '120103': `支持以下参数名称 :`,
	'120104': `{{id}}, {{title}}, {{type}}, {{score}}, {{image}},`,
	'120105': `{{url}}, {{desc}}, {{datePublished}}, {{genre}}, `,
	'120106': `{{originalTitle}},{{director}}, {{author}},`,
	'120107': ` {{actor}}`,

    '120201': `书籍文本模板`,
    '120202': `设置选择书籍后导入的文本内容模板,`,
    '120203': `支持以下参数名称 :`,
	'120204': `{{id}}, {{title}}, {{type}}, {{score}}, {{image}},`,
	'120205': `{{url}}, {{desc}}, {{datePublished}}, {{publisher}}`,
	'120206': `{{originalTitle}}, {{subTitle}}, {{author}},`,
	'120207': `{{translator}}, {{isbn}}, {{price}}, {{totalPage}}`,

    '120301': `音乐文本模板`,
    '120302': `设置选择音乐后导入的文本内容模板,`,
    '120303': `支持以下参数名称 :`,
	'120304': `{{id}}, {{title}}, {{type}}, {{image}},`,
	'120305': `{{url}}, {{desc}}, {{datePublished}}`,
	'120306': `{{genre}}, {{actor}}, {{medium}}, {{albumType}},`,
	'120307': `{{barcode}}, {{numberOfRecords}}`,

    '120401': `日记文本模板`,
    '120402': `设置选择日记后导入的文本内容模板,`,
    '120403': `支持以下参数名称 :`,
	'120404': `{{id}}, {{title}}, {{type}}, {{image}},`,
	'120405': `{{url}}, {{desc}}, {{datePublished}}`,
	'120406': `{{author}}, {{authorUrl}}, {{content}}`,

	'121301': `游戏文本模板`,
	'121302': `设置选择游戏后导入的文本内容模板,`,
	'121303': `支持以下参数名称 :`,
	'121304': `{{id}}, {{title}}, {{type}}, {{score}}, {{image}},`,
	'121305': `{{url}}, {{desc}}, {{publisher}}, {{datePublished}}`,
	'121306': `{{genre}}, {{aliases}}, {{developer}}, {{platform}}`,


    '120501': `日期格式`,
    '120503': `这个格式是给上面获取到的参数进行格式化日期时显示的内容 .`,
    '120502': `时间格式`,
    '120504': `这个格式是给上面获取到的参数进行格式化时间时显示的内容 .`,
    '120506': `详细介绍请参考`,
    '120507': `时间参数时间格式预览`,
    '120508': `格式参考`,
    '120601': `数组分割字符串`,
    '120602': `当模板中的变量存在数组, 则需要设定数组元素中的分割符号,比如演员列表等.
    举例: '/'	
    则演员表将会显示为: '演员1/演员2/演员3'`,
    '120701': `豆瓣HTTP请求头`,
    '120702': `如果豆瓣搜索或者获取数据失败,请尝试修改这个参数,\n
     参数获取方式为:\n
     1. 访问http://www.douban.com
     2. 复制请求头,仅复制以下请求头 `,
     '120801': `暂时不支持该类型导入,请至Github提交issuess获取帮助`,
     '120901': `豆瓣网`,

     '121201': `人名显示模式`,
     '121202': `可选项:`,
     '121203': `中文名称模式, 人名只显示中文名`,
     '121204': `英文名称模式, 人名只显示英文名`,
     '121205': `中文和英文名称模式, 人名同时显示中文和英文名`,
     '121206': `中文名`,
     '121207': `英文名`,
     '121208': `中文名和英文名`,

     '130101': `获取数据失败,您如有需要请至Github提交Issues`,
     '130102': `Obsidian Douban插件错误提示:`,
     '130103': `Obsidian Douban插件异常提示:`,
	 '140101': `当前版本暂不支持该类型导入,请升级Obsidian Douban或至github提交issuess获取帮助`,


}
