//简体中文
export default {
    //main.ts
    '110001': '用当前文档名搜索豆瓣并写入当前文档',
    '110002': '在豆瓣搜索并写入到当前文档',
    '110003': `输入搜索内容:`,
    '110004': `搜索`,
    '110005': `取消`,
    '110006': `同步豆瓣广播至Obsidian`,

    //DoubanSettingTab
	'1201'	: `Obsidian-豆瓣`,
    '120001': `豆瓣搜索地址`,
    '120002': `豆瓣搜索页面请求地址, 通常是网页搜索的地址. `,
    '120003': `先访问:`,
    '120004': `然后在搜索输入框不输入任何内容,直接点击搜索,`,
    '120005': `所跳转的网页地址即是搜索地址,`,
    '120006': `将网页地址复制到当前输入框即可,`,

    '120101': `电影文本模板`,
    '120102': `设置选择电影后导入的文本内容模板,`,
    '120103': `支持以下参数名称 :`,
    '120104': `{{id}},  {{type}},  {{title}}, {{originalTitle}},`,
    '120105': `{{score}}, {{datePublished}}, {{director}},`,
    '120106': `{{author}}, {{actor}}, {{desc}}, {{genre}},`,
    '120107': `{{image}}, {{url}}`,

    '120201': `书籍文本模板`,
    '120202': `设置选择书籍后导入的文本内容模板,`,
    '120203': `支持以下参数名称 :`,
    '120204': `{{id}}, {{title}}, {{originalTitle}}, {{subTitle}},`,
    '120205': `{{score}}, {{author}}, {{datePublished}}, {{type}},`,
    '120206': `{{publish}}, {{desc}}, {{translator}}, {{isbn}},`,
    '120207': `{{image}}, {{url}}, {{price}}, {{desc}}, {{totalPage}}`,

    '120301': `音乐文本模板`,
    '120302': `设置选择音乐后导入的文本内容模板,`,
    '120303': `支持以下参数名称 :`,
    '120304': `{{id}}, {{title}}, {{actor}}, {{genre}},`,
    '120305': `{{score}}, {{medium}}, {{datePublished}}, {{type}},`,
    '120306': `{{publish}}, {{desc}}, {{albumType}}, {{barcode}},`,
    '120307': `{{image}}, {{url}}, {{numberOfRecords}}, {{desc}}`,

    '120401': `日记文本模板`,
    '120402': `设置选择日记后导入的文本内容模板,`,
    '120403': `支持以下参数名称 :`,
    '120404': `{{id}}, {{title}}, {{author}}, {{authorUrl}},`,
    '120405': `{{timePublished}}, {{url}}, {{desc}}, {{type}},`,
    '120406': `{{content}}`,


    '120501': `参数日期格式`,
    '120503': `这个格式是给上面获取到的参数进行格式化日期时显示的内容 .`,
    '120502': `参数时间格式`,
    '120504': `这个格式是给上面获取到的参数进行格式化时间时显示的内容 .`,
    '120506': `详细介绍请参考`,
    '120507': `时间参数时间格式预览`,
    '120508': `格式参考`,
    '120601': `数组分割字符串`,
    '120602': `当模板中的变量存在数组, 则需要设定数组元素中的分割符号,比如 演员列表等`,
    '120701': `豆瓣HTTP请求头`,
    '120702': `如果豆瓣搜索或者获取数据失败,请尝试修改这个参数,\n
     参数获取方式为:\n
     1. 访问http://www.douban.com
     2. 复制请求头,仅复制以下请求头 `,
     '120801': `暂时不支持该类型导入,请至github提交issuess获取帮助`,
     '120901': `豆瓣网`,

     '121201': `人名显示模式`,
     '121202': `可选项:`,
     '121203': `中文名称模式, 人名只显示中文名`,
     '121204': `英文名称模式, 人名只显示英文名`,
     '121205': `中文和英文名称模式, 人名同时显示中文和英文名`,
     '121206': `中文名`,
     '121207': `英文名`,
     '121208': `中文名和英文名`,

     '130101': `获取数据失败,您如有需要请至Github提交Issues`,
     '130102': `Obsidian Douban插件错误提示:`,
     '130103': `Obsidian Douban插件异常提示:`,
	 '140101': `当前版本暂不支持该类型导入,请升级Obsidian Douban或至github提交issuess获取帮助`,


}
